#+TITLE:     Org Mode
#+AUTHOR:    Carsten Dominik
#+EMAIL:     tsd@tsdye.com
#+DATE:      2012-11-10 Sat
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+PROPERTY: exports results
#+PROPERTY: results raw
#+TEXINFO_HEADER: @c
#+TEXINFO_HEADER: @c Added by tsd [2012-11-11 Sun]
#+TEXINFO_HEADER: @documentencoding UTF-8
#+TEXINFO_HEADER: @c
#+TEXINFO_HEADER: @include org-version.inc
#+TEXINFO_HEADER: @c
#+TEXINFO_HEADER: @c Use proper quote and backtick for code sections in PDF output
#+TEXINFO_HEADER: @c Cf. Texinfo manual 14.2
#+TEXINFO_HEADER: @set txicodequoteundirected
#+TEXINFO_HEADER: @set txicodequotebacktick
#+TEXINFO_HEADER: @c
#+TEXINFO_HEADER: @c Version and Contact Info
#+TEXINFO_HEADER: @set MAINTAINERSITE @uref{http://orgmode.org,maintainers webpage}
#+TEXINFO_HEADER: @set MAINTAINER Carsten Dominik
#+TEXINFO_HEADER: @set MAINTAINEREMAIL @email{carsten at orgmode dot org}
#+TEXINFO_HEADER: @set MAINTAINERCONTACT @uref{mailto:carsten at orgmode dot org,contact the maintainer}
#+SUBTITLE: Release @value{VERSION}
#+SUBAUTHOR:  with contributions by David O'Toole, Bastien Guerry, Philip Rooke, Dan Davison, Eric Schulte, Thomas Dye and Jambunathan K.
#+TEXINFO_DIR_CATEGORY: Emacs editing modes
#+TEXINFO_DIR_TITLE: Org Mode: (org)
#+TEXINFO_DIR_DESC: Outline-based notes management and organizer
#+TEXINFO_POST_HEADER: @c -----------------------------------------------------------------------------
#+TEXINFO_POST_HEADER: 
#+TEXINFO_POST_HEADER: @c Macro definitions for commands and keys
#+TEXINFO_POST_HEADER: @c =======================================
#+TEXINFO_POST_HEADER: 
#+TEXINFO_POST_HEADER: @c The behavior of the key/command macros will depend on the flag cmdnames
** Column groups                
   :PROPERTIES:
   :DESCRIPTION: Grouping to trigger vertical lines
   :END:
call_index(type="concept",entry="grouping columns in tables")

When Org exports tables, it does so by default without vertical
lines because that is visually more satisfying in general.  Occasionally
however, vertical lines can be useful to structure a table into groups
of columns, much like horizontal lines can do for groups of rows.  In
order to specify column groups, you can use a special row where the
first field contains only {{{samp(/)}}}.  The further fields can either
contain {{{samp(<)}}} to indicate that this column should start a group,
{{{samp(>)}}} to indicate the end of a column, or {{{samp(<>)}}} (no space between {{{samp(<)}}}
and {{{samp(>)}}}) to make a column
a group of its own.  Boundaries between column groups will upon export be
marked with vertical lines.  Here is an example:

#+begin_example
| N | N^2 | N^3 | N^4 | sqrt(n) | sqrt[4](N) |
|---+-----+-----+-----+---------+------------|
| / |   < |     |   > |       < |          > |
| 1 |   1 |   1 |   1 |       1 |          1 |
| 2 |   4 |   8 |  16 |  1.4142 |     1.1892 |
| 3 |   9 |  27 |  81 |  1.7321 |     1.3161 |
|---+-----+-----+-----+---------+------------|
#+TBLFM: $2=$1^2::$3=$1^3::$4=$1^4::$5=sqrt($1)::$6=sqrt(sqrt(($1)))
#+end_example

It is also sufficient to just insert the column group starters after
every vertical line you would like to have:

#+begin_example
|  N | N^2 | N^3 | N^4 | sqrt(n) | sqrt[4](N) |
|----+-----+-----+-----+---------+------------|
| /  | <   |     |     | <       |            |
#+end_example

*** Duration and time values
    :PROPERTIES:
    :DESCRIPTION: How to compute duration and time values
    :END:
call_index(type="concept",entry="Duration, computing")
call_index(type="concept",entry="Time, computing")
call_index(type="variable",entry="org-table-duration-custom-format")

If you want to compute time values use the ~T~ flag, either in Calc
formulas or Elisp formulas:

#+begin_example
  |  Task 1 |   Task 2 |    Total |
  |---------+----------+----------|
  |    2:12 |     1:47 | 03:59:00 |
  | 3:02:20 | -2:07:00 |     0.92 |
  #+TBLFM: @@2$3=$1+$2;T::@@3$3=$1+$2;t
#+end_example

Input duration values must be of the form ~[HH:MM[:SS]~,
where seconds are optional. With the ~T~ flag, computed
durations will be displayed as ~HH:MM:SS~ (see the first
formula above). With the ~t~ flag, computed durations will
be displayed according to the value of the variable
~org-table-duration-custom-format~, which defaults to
~'hours~ and will display the result as a fraction of hours
(see the second formula in the example above).

Negative duration values can be manipulated as well, and integers will be
considered as seconds in addition and subtraction.

*** Advanced features
    :PROPERTIES:
    :DESCRIPTION: Field and column names, parameters, and automatic recalc
    :END:
If you want the recalculation of fields to happen automatically, or if
you want to be able to assign /names/ [fn:33] to fields and columns,
you need to reserve the first column of the table for special marking
characters.

#+attr_texinfo: :table-type "table" :indic "@asis"
  - {{{orgcmd(C-#,org-table-rotate-recalc-marks)}}} :: Rotate the calculation mark in first column through the states {{{samp( )}}},
    {{{samp(#)}}}, {{{samp(*)}}}, {{{samp(!)}}}, {{{samp($)}}}.  When there is an active region,
    change all marks in the region.

Here is an example of a table that collects exam results of students and
makes use of these features:

#+begin_example
|---+---------+--------+--------+--------+-------+------|
|   | Student | Prob 1 | Prob 2 | Prob 3 | Total | Note |
|---+---------+--------+--------+--------+-------+------|
| ! |         |     P1 |     P2 |     P3 |   Tot |      |
| # | Maximum |     10 |     15 |     25 |    50 | 10.0 |
| ^ |         |     m1 |     m2 |     m3 |    mt |      |
|---+---------+--------+--------+--------+-------+------|
| # | Peter   |     10 |      8 |     23 |    41 |  8.2 |
| # | Sam     |      2 |      4 |      3 |     9 |  1.8 |
|---+---------+--------+--------+--------+-------+------|
|   | Average |        |        |        |  25.0 |      |
| ^ |         |        |        |        |    at |      |
| $ | max=50  |        |        |        |       |      |
|---+---------+--------+--------+--------+-------+------|
#+TBLFM: $6=vsum($P1..$P3)::$7=10*$Tot/$max;%.1f::$at=vmean(@@-II..@@-I);%.1f
#+end_example

{{{noindent}}} *Important*: please note that for these special tables,
recalculating the table with {{{kbd(C-u C-c *)}}} will only affect rows that
are marked {{{samp(#)}}} or {{{samp(*)}}}, and fields that have a formula assigned
to the field itself.  The column formulas are not applied in rows with
empty first field.

call_index(type="concept",entry="marking characters, tables")
The marking characters have the following meaning:
#+attr_texinfo: :table-type "table" :indic "@samp"
  - ! ::
    The fields in this line define names for the columns, so that you may
    refer to a column as {{{samp($Tot)}}} instead of {{{samp($6)}}}.
  - ^ ::
    This row defines names for the fields @emph{above} the row.  With such
    a definition, any formula in the table may use {{{samp($m1)}}} to refer to
    the value {{{samp(10)}}}.  Also, if you assign a formula to a names field, it
    will be stored as {{{samp($name=...)}}}.
  - _ :: Similar to {{{samp(^)}}}, but defines names for the fields in
         the row /below/.
  - $ :: Fields in this row can define /parameters/ for formulas.  For
    example, if a field in a {{{samp($)}}} row contains {{{samp(max=50)}}}, then
    formulas in this table can refer to the value 50 using {{{samp($max)}}}.
    Parameters work exactly like constants, only that they can be defined on
   a per-table basis.
  - # :: Fields in this row are automatically recalculated when pressing
    {{{key(TAB)}}} or {{{key(RET)}}} or {{{kbd(S-@key{TAB})}}} in this row.  Also, this row
    is selected for a global recalculation with {{{kbd(C-u C-c *)}}}.  Unmarked
    lines will be left alone by this command.
  - * :: Selects this line for global recalculation with {{{kbd(C-u C-c *)}}}, but
    not for automatic recalculation.  Use this when automatic
   recalculation slows down editing too much.
  - :: Unmarked lines are exempt from recalculation with {{{kbd(C-u C-c *)}}}.
    All lines that should be recalculated should be marked with {{{samp(#)}}}
    or {{{samp(*)}}}.
  - / :: Do not export this line.  Useful for lines that contain the narrowing
    {{{samp(<N>)}}} markers or column group markers.


Finally, just to whet your appetite for what can be done with the
fantastic {{{file(calc.el)}}} package, here is a table that computes the Taylor
series of degree ~n~ at location ~x~ for a couple of
functions.

#+begin_example
|---+-------------+---+-----+--------------------------------------|
|   | Func        | n | x   | Result                               |
|---+-------------+---+-----+--------------------------------------|
| # | exp(x)      | 1 | x   | 1 + x                                |
| # | exp(x)      | 2 | x   | 1 + x + x^2 / 2                      |
| # | exp(x)      | 3 | x   | 1 + x + x^2 / 2 + x^3 / 6            |
| # | x^2+sqrt(x) | 2 | x=0 | x*(0.5 / 0) + x^2 (2 - 0.25 / 0) / 2 |
| # | x^2+sqrt(x) | 2 | x=1 | 2 + 2.5 x - 2.5 + 0.875 (x - 1)^2    |
| * | tan(x)      | 3 | x   | 0.0175 x + 1.77e-6 x^3               |
|---+-------------+---+-----+--------------------------------------|
#+TBLFM: $5=taylor($2,$4,$3);n3
#+end_example

*** Texi -> Org helpers
#+name: index
#+header: :var type="concept"
#+header: :var entry="entry, test"
#+begin_src emacs-lisp
(format "@@info:@%s@@ %s" (cond 
          ((equal type "concept") "cindex")
          ((equal type "variable") "vindex")
          ((equal type "function") "findex")
          ((equal type "keystroke") "kindex")
          ((equal type "program") "pindex")
          ((equal type "data type") "tindex")
          (t type)) entry)
#+end_src

#+results: make-index
@@info:@cindex@@ entry, test

The variable type: "start", "end", "parenthetical", "info"
The variable to: 
#+name: ref
#+header: :var type="end"
#+header: :var node="Top"
#+header: :var xref=""
#+header: :var topic=""
#+header: :var file-name=""
#+header: :var manual=""
#+begin_src emacs-lisp
(format "@@info:@%s{%s,%s,%s,%s,%s}@@"
        (cond
         ((member type '("start" "start sentence")) "xref")
         ((member type '("end" "mid" "end sentence" "mid sentence")) "ref")
         ((member type '("paren" "parens" "parenthetical")) "pxref")
         ((equal type "info") "inforef")
         (t type)) node xref topic file-name manual)
#+end_src

#+name: roman-replace
#+header: :results silent
#+header: :eval no-export
#+begin_src emacs-lisp
(defun tsd-roman-replace ()
  "Replace roman commands"
  (interactive)
  (query-replace-regexp "@r{\([^}]*\)}" "\\1" nil))
(define-key org-mode-map (kbd "C-c r") 'tsd-roman-replace)
#+end_src


#+name: emphasis-replace
#+header: :results silent
#+header: :eval no-export
#+begin_src emacs-lisp
(defun tsd-emphasis-replace ()
  "Replace various emphasis commands with //"
  (interactive)
  (progn 
  (query-replace-regexp "@i{\([^}]*\)}" "/\\1/" nil)
  (query-replace-regexp "@emph{\([^}]*\)}" "/\\1/" nil)))
(define-key org-mode-map (kbd "C-c E") 'tsd-emphasis-replace)
#+end_src

#+name: simple-command-macros
#+header: :results silent
#+header: :eval no-export
#+begin_src emacs-lisp
(defun tsd-simple-command-macros ()
  "Make macros out of simple @ commands"
  (interactive)
  (query-replace-regexp "@\\([command|tsubheading|pxref|samp|file|key|kbd]+\\){\\([^}]*\\)}" "{{{\\1(\\2)}}}" nil))
(define-key org-mode-map (kbd "C-c s") 'tsd-simple-command-macros)
#+end_src

#+name: two-arg-org-command-macros
#+header: :results silent
#+header: :eval no-export
#+begin_src emacs-lisp
(defun tsd-two-arg-orgcmd-macros ()
  "Make macros out of two argument org* commands"
  (interactive)
  (query-replace-regexp "@\\([x]*orgcmd[nki|kkcc]*\\){\\([^,]*\\),\\(.*\\)}" "{{{\\1(\\2,\\3)}}}" nil))
(define-key org-mode-map (kbd "C-c o") 'tsd-two-arg-orgcmd-macros)
#+end_src

